# BaseDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement..::..BaseDirection Property
TextElement Class See Also
---
Direction of the base line of the text element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ BaseDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ BaseDirection {
	XYZ^ get ();
}
```

# Remarks
Base direction is always perpendicular to Up direction. Those two vectors together define the plane of the text.
# See Also
TextElement Class
Autodesk.Revit.DB Namespace